DataProcessors/ЕжедневныйОтчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЕжедневныйОтчет</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОтчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>мТекущаяНастройка</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокКонтрагентов</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КатегорииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КатегорииОбъектов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыОтветственногоХранения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыОтветственногоХранения</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ЕжедневныйОтчет/Ext/ObjectModule.bsl
Процедура СформироватьОтчет(Интерактивно = Ложь) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(ДатаОтчета) Тогда
		ДатаОтчета = ТекущаяДата();                
	КонецЕсли;   
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РеализацияТоваровУслуг.Контрагент) КАК Контрагент
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Проведен
	|	И РеализацияТоваровУслуг.Дата МЕЖДУ &Дата1 И &Дата2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТоварыНаСкладахОстатки.Номенклатура) КАК Номенклатура
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата2, Склад В ИЕРАРХИИ (&Склад)) КАК ТоварыНаСкладахОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК ЭлАдрес
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	|		ПО КонтактнаяИнформация.Объект = КатегорииОбъектов.Объект
	|			И (КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.ОтправлятьДневнойОтчет))
	|ГДЕ
	|	КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailРабочийФизическогоЛица)
	|	И (ВЫРАЗИТЬ(ЕСТЬNULL(КонтактнаяИнформация.Представление, """""""") КАК СТРОКА(200))) <> """"""""";
	
	Склад = Константы.ОсновнойСклад.Получить();
	
	Запрос.УстановитьПараметр("Дата1", НачалоМесяца(ДатаОтчета));
	Запрос.УстановитьПараметр("Дата2", КонецДня(ДатаОтчета));
	Запрос.УстановитьПараметр("Склад", Склад);
	Пакетник = Запрос.ВыполнитьПакет();
	ТаблицаЭлАдресов =   Пакетник[2].Выгрузить();
	
	// А есть ли получатели отчета? 
	Если Интерактивно Тогда
		
		Если ТаблицаЭлАдресов.Количество() =   0 Тогда
			
			ЗаписьЖурналаРегистрации("Отправка электронной почты.Ошибка",УровеньЖурналаРегистрации.Ошибка,,,"Не заполнен список рассылки");
			Возврат; 		
			
		КонецЕсли; 
		
	КонецЕсли;
	
	ТЗ1 = Пакетник[0].Выгрузить();
	ТЗ2 = Пакетник[1].Выгрузить();
	
	Если ТЗ1.Количество() > 0 Тогда 
		Сумма5 = ТЗ1[0].Контрагент;
	Иначе 
		Сумма5 = 0;
	КонецЕсли;
	
	Если ТЗ2.Количество() > 0 Тогда 
		Сумма7 = ТЗ2[0].Номенклатура;
	Иначе 
		Сумма7 = 0;
	КонецЕсли; 
	
	Если Интерактивно Тогда
		
		СтруктураНастройки = Новый Структура;
		СтруктураНастройки.Вставить("Пользователь", Справочники.Пользователи.НайтиПоКоду("webadmin"));
		СтруктураНастройки.Вставить("ИмяОбъекта", "ОбработкаОбъект.ЕжедневныйОтчет");	
		СтруктураНастройки.Вставить("НаименованиеНастройки", "ЕжедневныйОтчетРегламентное");
		
		Если УниверсальныеМеханизмы.ПолучитьНастройку(СтруктураНастройки) Тогда 		
			
			ЭтотОбъект.мТекущаяНастройка = СтруктураНастройки;
			ВосстановитьНастройкиРегламентаИзСтруктуры(СтруктураНастройки.СохраненнаяНастройка);
			
		КонецЕсли;
		
	КонецЕсли;

	Сумма1   = 0; //Оборот с начала месяца(EUR)
	Сумма2   = 0; //Оборот с начала месяца(RUB)
	Сумма3   = 0; //Валовая прибыть с начала месяца(EUR) 
	Сумма3_1 = 0; //Валовая прибыть с начала месяца(RUB) 
	Сумма4   = 0; //Рентабельность в %(по валюте EUR)
	Сумма6   = 0; //Себестоимость в  EUR
	
	
	ЗапросПродаж = Новый Запрос;
	ЗапросПродаж.Текст = 
	"ВЫБРАТЬ
	|	КурсыВалют.Период КАК Период,
	|	КурсыВалют.Курс
	|ПОМЕСТИТЬ ВТ_КурсыВалют
	|ИЗ
	|	РегистрСведений.КурсыВалют КАК КурсыВалют
	|ГДЕ
	|	КурсыВалют.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И КурсыВалют.Валюта = &Евро
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.ПериодДень КАК Период,
	|	ВложенныйЗапрос.Стоимость КАК Продажа,
	|	ВложенныйЗапрос.Себестоимость КАК Себестоимость,
	|	ВложенныйЗапрос.Стоимость - ВложенныйЗапрос.Себестоимость КАК ВаловаяПрибыль,
	|	ВложенныйЗапрос.Стоимость / ЕСТЬNULL(ВТ_КурсыВалют.Курс, 1) КАК ПродажаЕвро,
	|	(ВложенныйЗапрос.Стоимость - ВложенныйЗапрос.Себестоимость) / ЕСТЬNULL(ВТ_КурсыВалют.Курс, 1) КАК ВаловаяПрибыльЕвро
	|ИЗ
	|	(ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, ДЕНЬ) КАК ПериодДень,
	|		СУММА(ВложенныйЗапрос.Количество) КАК Количество,
	|		СУММА(ВЫБОР
	|				КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	|					ТОГДА ВложенныйЗапрос.Стоимость
	|				ИНАЧЕ ВложенныйЗапрос.Стоимость * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	|			КОНЕЦ) КАК Стоимость,
	|		СУММА(ВложенныйЗапрос.Себестоимость) КАК Себестоимость
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ПродажиОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|			ПродажиОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
	|			ПродажиОбороты.Регистратор КАК Регистратор,
	|			ПродажиОбороты.Период КАК Период,
	|			ПродажиОбороты.КоличествоОборот КАК КоличествоПродажи,
	|			ПродажиОбороты.КоличествоОборот - ЕСТЬNULL(ТаблТОХ.КоличествоОборот, 0) КАК Количество,
	|			ВЫБОР
	|				КОГДА ПродажиОбороты.КоличествоОборот - ЕСТЬNULL(ТаблТОХ.КоличествоОборот, 0) = 0
	|					ТОГДА 0
	|				ИНАЧЕ ПродажиОбороты.СтоимостьОборот
	|			КОНЕЦ КАК Стоимость,
	|			(ПродажиОбороты.КоличествоОборот - ЕСТЬNULL(ТаблТОХ.КоличествоОборот, 0)) * ТаблСебестоимость.Себестоимость КАК Себестоимость
	|		ИЗ
	|			РегистрНакопления.Продажи.Обороты(&ДатаНач, &ДатаКон, Регистратор, %УсловиеКонтрагент%) КАК ПродажиОбороты
	|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|					ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|					ВложенныйЗапрос.Себестоимость КАК Себестоимость
	|				ИЗ
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|						ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|						СУММА(ВЫБОР
	|								КОГДА ВложенныйЗапрос.КоличествоПриходНач = 0
	|									ТОГДА ОКР(ВложенныйЗапрос.СтоимостьПриходНач / 1, 2)
	|								ИНАЧЕ ОКР(ВложенныйЗапрос.СтоимостьПриходНач / ВложенныйЗапрос.КоличествоПриходНач, 2)
	|							КОНЕЦ) КАК Себестоимость
	|					ИЗ
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							ВЫБОР
	|								КОГДА ПартииТоваровНаСкладахОстатки.Номенклатура ЕСТЬ NULL
	|									ТОГДА ПартииТоваровНаСкладахОбороты.Номенклатура
	|								ИНАЧЕ ПартииТоваровНаСкладахОстатки.Номенклатура
	|							КОНЕЦ КАК Номенклатура,
	|							ВЫБОР
	|								КОГДА ПартииТоваровНаСкладахОстатки.ХарактеристикаНоменклатуры ЕСТЬ NULL
	|									ТОГДА ПартииТоваровНаСкладахОбороты.ХарактеристикаНоменклатуры
	|								ИНАЧЕ ПартииТоваровНаСкладахОстатки.ХарактеристикаНоменклатуры
	|							КОНЕЦ КАК ХарактеристикаНоменклатуры,
	|							СУММА(ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ПартииТоваровНаСкладахОбороты.КоличествоПриход, 0)) КАК КоличествоПриходНач,
	|							СУММА(ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.СтоимостьОстаток, 0) + ЕСТЬNULL(ПартииТоваровНаСкладахОбороты.СтоимостьПриход, 0)) КАК СтоимостьПриходНач
	|						ИЗ
	|							РегистрНакопления.ПартииТоваровНаСкладах.Остатки(&ДатаНач, ) КАК ПартииТоваровНаСкладахОстатки
	|								ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровНаСкладах.Обороты(&ДатаНач, &ДатаКон, Регистратор, ) КАК ПартииТоваровНаСкладахОбороты
	|								ПО ПартииТоваровНаСкладахОстатки.Номенклатура = ПартииТоваровНаСкладахОбороты.Номенклатура
	|									И ПартииТоваровНаСкладахОстатки.ХарактеристикаНоменклатуры = ПартииТоваровНаСкладахОбороты.ХарактеристикаНоменклатуры
	|									И ПартииТоваровНаСкладахОстатки.ДокументОприходования = ПартииТоваровНаСкладахОбороты.ДокументОприходования
	|									И ПартииТоваровНаСкладахОстатки.Заказ = ПартииТоваровНаСкладахОбороты.Заказ
	|									И ПартииТоваровНаСкладахОстатки.Склад = ПартииТоваровНаСкладахОбороты.Склад
	|									И ПартииТоваровНаСкладахОстатки.СерияНоменклатуры = ПартииТоваровНаСкладахОбороты.СерияНоменклатуры
	|									И ПартииТоваровНаСкладахОстатки.СтатусПартии = ПартииТоваровНаСкладахОбороты.СтатусПартии
	|									И ПартииТоваровНаСкладахОстатки.Качество = ПартииТоваровНаСкладахОбороты.Качество
	|						
	|						СГРУППИРОВАТЬ ПО
	|							ВЫБОР
	|								КОГДА ПартииТоваровНаСкладахОстатки.Номенклатура ЕСТЬ NULL
	|									ТОГДА ПартииТоваровНаСкладахОбороты.Номенклатура
	|								ИНАЧЕ ПартииТоваровНаСкладахОстатки.Номенклатура
	|							КОНЕЦ,
	|							ВЫБОР
	|								КОГДА ПартииТоваровНаСкладахОстатки.ХарактеристикаНоменклатуры ЕСТЬ NULL
	|									ТОГДА ПартииТоваровНаСкладахОбороты.ХарактеристикаНоменклатуры
	|								ИНАЧЕ ПартииТоваровНаСкладахОстатки.ХарактеристикаНоменклатуры
	|							КОНЕЦ) КАК ВложенныйЗапрос
	|					
	|					СГРУППИРОВАТЬ ПО
	|						ВложенныйЗапрос.Номенклатура,
	|						ВложенныйЗапрос.ХарактеристикаНоменклатуры) КАК ВложенныйЗапрос) КАК ТаблСебестоимость
	|				ПО ПродажиОбороты.Номенклатура = ТаблСебестоимость.Номенклатура
	|					И ПродажиОбороты.ХарактеристикаНоменклатуры = ТаблСебестоимость.ХарактеристикаНоменклатуры
	|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					ТоварыОтветственногоХраненияОбороты.Регистратор КАК Регистратор,
	|					ТоварыОтветственногоХраненияОбороты.Номенклатура КАК Номенклатура,
	|					ТоварыОтветственногоХраненияОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|					ТоварыОтветственногоХраненияОбороты.Контрагент КАК Контрагент,
	|					ТоварыОтветственногоХраненияОбороты.КоличествоОборот * -1 КАК КоличествоОборот
	|				ИЗ
	|					РегистрНакопления.ТоварыОтветственногоХранения.Обороты(&ДатаНач, &ДатаКон, Регистратор,) КАК ТоварыОтветственногоХраненияОбороты
	|				ГДЕ
	|					ВЫРАЗИТЬ(ТоварыОтветственногоХраненияОбороты.Регистратор КАК Документ.РеализацияТоваровУслуг) ЕСТЬ НЕ NULL 
	|				{ГДЕ
	|					ТоварыОтветственногоХраненияОбороты.Номенклатура.*,
	|					ТоварыОтветственногоХраненияОбороты.ХарактеристикаНоменклатуры.*}) КАК ТаблТОХ
	|				ПО ПродажиОбороты.Номенклатура = ТаблТОХ.Номенклатура
	|					И ПродажиОбороты.ХарактеристикаНоменклатуры = ТаблТОХ.ХарактеристикаНоменклатуры
	|					И ПродажиОбороты.Регистратор = ТаблТОХ.Регистратор
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ПродажиОбороты.ХарактеристикаНоменклатуры,
	|			ПродажиОбороты.ЗаказПокупателя,
	|			ПродажиОбороты.Регистратор,
	|			ПродажиОбороты.Период,
	|			ПродажиОбороты.КоличествоОборот,
	|			ЕСТЬNULL(ТаблТОХ.КоличествоОборот, 0),
	|			ПродажиОбороты.СтоимостьОборот,
	|			ЕСТЬNULL(ТаблТОХ.СебестоимостьТОХ, 0)
	|		ИЗ
	|			РегистрНакопления.Продажи.Обороты(&ДатаНач, &ДатаКон, Регистратор, %УсловиеКонтрагент% ) КАК ПродажиОбороты
	|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВложенныйЗапрос.Регистратор КАК Регистратор,
	|					ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|					ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|					ВложенныйЗапрос.Контрагент КАК Контрагент,
	|					ВложенныйЗапрос.КоличествоОборот * -1 КАК КоличествоОборот,
	|					ЕСТЬNULL(ЦеныНоменклатурыКонтрагентов.Цена, 0) * ВложенныйЗапрос.КоличествоОборот * -1 КАК СебестоимостьТОХ
	|				ИЗ
	|					(ВЫБРАТЬ
	|						ТоварыОтветственногоХраненияОбороты.Регистратор КАК Регистратор,
	|						ТоварыОтветственногоХраненияОбороты.Номенклатура КАК Номенклатура,
	|						ТоварыОтветственногоХраненияОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|						ТоварыОтветственногоХраненияОбороты.Контрагент КАК Контрагент,
	|						МАКСИМУМ(ТоварыОтветственногоХраненияОбороты.КоличествоОборот) КАК КоличествоОборот,
	|						ТоварыОтветственногоХраненияОбороты.ДоговорКонтрагента.ТипЦен КАК ТипЦен,
	|						МАКСИМУМ(ЦеныНоменклатурыКонтрагентов.Период) КАК ПериодЦены
	|					ИЗ
	|						РегистрНакопления.ТоварыОтветственногоХранения.Обороты(&ДатаНач, &ДатаКон, Регистратор, {(Организация).* КАК Организация, (Контрагент).* КАК Поставщик, (ДоговорКонтрагента).* КАК ДоговорПокупателя, (Номенклатура).* КАК Номенклатура, (ХарактеристикаНоменклатуры).* КАК ХарактеристикаНоменклатуры}) КАК ТоварыОтветственногоХраненияОбороты
	|							ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыКонтрагентов КАК ЦеныНоменклатурыКонтрагентов
	|							ПО ТоварыОтветственногоХраненияОбороты.Период >= ЦеныНоменклатурыКонтрагентов.Период
	|								И ТоварыОтветственногоХраненияОбороты.Номенклатура = ЦеныНоменклатурыКонтрагентов.Номенклатура
	|								И ТоварыОтветственногоХраненияОбороты.ДоговорКонтрагента.ТипЦен = ЦеныНоменклатурыКонтрагентов.ТипЦен
	|					ГДЕ
	|						ВЫРАЗИТЬ(ТоварыОтветственногоХраненияОбороты.Регистратор КАК Документ.РеализацияТоваровУслуг) ЕСТЬ НЕ NULL 
	|					{ГДЕ
	|						ТоварыОтветственногоХраненияОбороты.Номенклатура.*,
	|						ТоварыОтветственногоХраненияОбороты.ХарактеристикаНоменклатуры.*}
	|					
	|					СГРУППИРОВАТЬ ПО
	|						ТоварыОтветственногоХраненияОбороты.ДоговорКонтрагента.ТипЦен,
	|						ТоварыОтветственногоХраненияОбороты.Регистратор,
	|						ТоварыОтветственногоХраненияОбороты.Номенклатура,
	|						ТоварыОтветственногоХраненияОбороты.ХарактеристикаНоменклатуры,
	|						ТоварыОтветственногоХраненияОбороты.Контрагент) КАК ВложенныйЗапрос
	|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыКонтрагентов КАК ЦеныНоменклатурыКонтрагентов
	|						ПО ВложенныйЗапрос.ПериодЦены = ЦеныНоменклатурыКонтрагентов.Период
	|							И ВложенныйЗапрос.Номенклатура = ЦеныНоменклатурыКонтрагентов.Номенклатура
	|							И ВложенныйЗапрос.ТипЦен = ЦеныНоменклатурыКонтрагентов.ТипЦен) КАК ТаблТОХ
	|				ПО ПродажиОбороты.Номенклатура = ТаблТОХ.Номенклатура
	|					И ПродажиОбороты.Регистратор = ТаблТОХ.Регистратор
	|					И ПродажиОбороты.ХарактеристикаНоменклатуры = ТаблТОХ.ХарактеристикаНоменклатуры) КАК ВложенныйЗапрос
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, ДЕНЬ)
	|	
	|	ИМЕЮЩИЕ
	|		(СУММА(ВложенныйЗапрос.Количество) <> 0
	|			ИЛИ СУММА(ВложенныйЗапрос.Себестоимость) <> 0
	|			ИЛИ СУММА(ВЫБОР
	|					КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	|						ТОГДА ВложенныйЗапрос.Стоимость
	|					ИНАЧЕ ВложенныйЗапрос.Стоимость * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	|				КОНЕЦ) <> 0)) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КурсыВалют КАК ВТ_КурсыВалют
	|		ПО ВложенныйЗапрос.ПериодДень = ВТ_КурсыВалют.Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период
	|ИТОГИ
	|	СУММА(Продажа),
	|	СУММА(Себестоимость),
	|	СУММА(ВаловаяПрибыль),
	|	СУММА(ПродажаЕвро),
	|	СУММА(ВаловаяПрибыльЕвро)
	|ПО
	|	ОБЩИЕ";
	
	
	ЗапросПродаж.УстановитьПараметр("ДатаНач", НачалоМесяца(ДатаОтчета));
	ЗапросПродаж.УстановитьПараметр("ДатаКон", КонецДня(ДатаОтчета));
	ЗапросПродаж.УстановитьПараметр("Евро", Справочники.Валюты.НайтиПоКоду("978"));
	
	Если НЕ СписокКонтрагентов.Количество() = 0 Тогда
		
		ЗапросПродаж.Текст = СтрЗаменить(ЗапросПродаж.Текст, "%УсловиеКонтрагент%", " НЕ Контрагент В (&СписокКонтрагентов)");
		ЗапросПродаж.УстановитьПараметр("СписокКонтрагентов", СписокКонтрагентов);
		
	Иначе
		ЗапросПродаж.Текст = СтрЗаменить(ЗапросПродаж.Текст, "%УсловиеКонтрагент%", "");
	КонецЕсли;
	
	РезультатЗапросаПродаж = ЗапросПродаж.Выполнить();
	
	Если Не РезультатЗапросаПродаж.Пустой() Тогда
		
		ВыборкаЗапроса = РезультатЗапросаПродаж.Выбрать(ОбходРезультатаЗапроса.Прямой);
		ВыборкаЗапроса.Следующий();
		
		Сумма1    = ВыборкаЗапроса.ПродажаЕвро;
		Сумма2    = ВыборкаЗапроса.Продажа;       												    
		Сумма3    = ВыборкаЗапроса.ВаловаяПрибыльЕвро;         
		Сумма3_1  = ВыборкаЗапроса.ВаловаяПрибыль;                            
		
	КонецЕсли;
	
	Сумма4 = Сумма3 / ?(Сумма1 = 0, 1, Сумма1) * 100;   
	
	ГруппаMiles = Константы.ГруппаMILES.Получить();
	
	Если ЗначениеЗаполнено(ГруппаMiles) Тогда  
		
		Запрос = Новый Запрос; 
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПродажиОбороты.Регистратор КАК Регистратор,
		|	ПродажиОбороты.Номенклатура,
		|	ПродажиОбороты.ХарактеристикаНоменклатуры,
		|	ПродажиОбороты.ЗаказПокупателя,
		|	ПродажиОбороты.ДоговорКонтрагента,
		|	ПродажиОбороты.ДокументПродажи,
		|	ПродажиОбороты.Подразделение,
		|	ПродажиОбороты.Проект,
		|	ПродажиОбороты.Организация,
		|	ПродажиОбороты.Контрагент,
		|	ПродажиОбороты.КоличествоОборот,
		|	ПродажиОбороты.СтоимостьОборот,
		|	ПродажиОбороты.СтоимостьБезСкидокОборот,
		|	ПродажиОбороты.НДСОборот,
		|	ПродажиОбороты.Период
		|ПОМЕСТИТЬ ВтПродажиВрем
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&НачПериода, &КонПериода, Регистратор, Номенклатура В ИЕРАРХИИ (&ГруппаMiles) %УсловиеКонтрагент%) КАК ПродажиОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(КурсыВалют.Период) КАК ПериодКурс,
		|	ВтПродажиВрем.Период КАК ПериодПродажи,
		|	КурсыВалют.Валюта
		|ПОМЕСТИТЬ ВтПериодКурса
		|ИЗ
		|	ВтПродажиВрем КАК ВтПродажиВрем
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО (КурсыВалют.Период <= ВтПродажиВрем.Период)
		|ГДЕ
		|	КурсыВалют.Валюта = &Валюта
		|
		|СГРУППИРОВАТЬ ПО
		|	ВтПродажиВрем.Период,
		|	КурсыВалют.Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтПериодКурса.ПериодПродажи,
		|	ВтПериодКурса.ПериодКурс,
		|	КурсыВалют.Валюта,
		|	КурсыВалют.Курс,
		|	КурсыВалют.Кратность
		|ПОМЕСТИТЬ ВтКурсыВалюты
		|ИЗ
		|	ВтПериодКурса КАК ВтПериодКурса
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО ВтПериодКурса.ПериодКурс = КурсыВалют.Период
		|			И ВтПериодКурса.Валюта = КурсыВалют.Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтПродажи.Регистратор,
		|	ВтПродажи.Номенклатура,
		|	ВтПродажи.ХарактеристикаНоменклатуры,
		|	ВтПродажи.ЗаказПокупателя,
		|	ВтПродажи.ДоговорКонтрагента,
		|	ВтПродажи.ДокументПродажи,
		|	ВтПродажи.Подразделение,
		|	ВтПродажи.Проект,
		|	ВтПродажи.Организация,
		|	ВтПродажи.Контрагент,
		|	ВтПродажи.КоличествоОборот,
		|	ВтПродажи.СтоимостьОборот,
		|	ВтПродажи.СтоимостьБезСкидокОборот,
		|	ВтПродажи.НДСОборот,
		|	ВтПродажи.Период,
		|	ВтКурсыВалюты.Курс,
		|	ВтКурсыВалюты.Кратность,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВтКурсыВалюты.Курс, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВтПродажи.СтоимостьОборот / ВтКурсыВалюты.Курс
		|	КОНЕЦ КАК СтоимостьВВалюте
		|ПОМЕСТИТЬ ВтПродажи
		|ИЗ
		|	ВтПродажиВрем КАК ВтПродажи
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтКурсыВалюты КАК ВтКурсыВалюты
		|		ПО ВтПродажи.Период = ВтКурсыВалюты.ПериодПродажи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВтПродажи.СтоимостьВВалюте) КАК СтоимостьОборот
		|ИЗ
		|	ВтПродажи КАК ВтПродажи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтПродажи.Контрагент,
		|	СУММА(ВтПродажи.КоличествоОборот) КАК КоличествоОборот
		|ПОМЕСТИТЬ ВтОборотыПоКонтрагентам
		|ИЗ
		|	ВтПродажи КАК ВтПродажи
		|
		|СГРУППИРОВАТЬ ПО
		|	ВтПродажи.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВтОборотыПоКонтрагентам.Контрагент) КАК КоличествоКонтрагентов
		|ИЗ
		|	ВтОборотыПоКонтрагентам КАК ВтОборотыПоКонтрагентам
		|ГДЕ
		|	ВтОборотыПоКонтрагентам.КоличествоОборот > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВтПродажи.СтоимостьОборот) КАК Стоимость
		|ИЗ
		|	ВтПродажи КАК ВтПродажи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.ПериодДень КАК Период,
		|	ВложенныйЗапрос.Стоимость - ВложенныйЗапрос.Себестоимость КАК ВаловаяПрибыль
		|ИЗ
		|	(ВЫБРАТЬ
		|		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, ДЕНЬ) КАК ПериодДень,
		|		СУММА(ВЫБОР
		|				КОГДА ВложенныйЗапрос.КоличествоОборот = 0
		|					ТОГДА ВложенныйЗапрос.Стоимость
		|				ИНАЧЕ ВложенныйЗапрос.Стоимость * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоОборот
		|			КОНЕЦ) КАК Стоимость,
		|		СУММА(ВложенныйЗапрос.Себестоимость) КАК Себестоимость
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ВтПродажи.Регистратор КАК Регистратор,
		|			ВтПродажи.Номенклатура КАК Номенклатура,
		|			ВтПродажи.КоличествоОборот КАК КоличествоОборот,
		|			ВтПродажи.КоличествоОборот - ЕСТЬNULL(ТаблТОХ.КоличествоОборот, 0) КАК Количество,
		|			ВтПродажи.Период КАК Период,
		|			(ВтПродажи.КоличествоОборот - ЕСТЬNULL(ТаблТОХ.КоличествоОборот, 0)) * ТаблСебестоимость.Себестоимость КАК Себестоимость,
		|			ВЫБОР
		|				КОГДА ВтПродажи.КоличествоОборот - ЕСТЬNULL(ТаблТОХ.КоличествоОборот, 0) = 0
		|					ТОГДА 0
		|				ИНАЧЕ ВтПродажи.СтоимостьОборот
		|			КОНЕЦ КАК Стоимость
		|		ИЗ
		|			ВтПродажи КАК ВтПродажи
		|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|					ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|					ВложенныйЗапрос.Себестоимость КАК Себестоимость
		|				ИЗ
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|						ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|						СУММА(ВЫБОР
		|								КОГДА ВложенныйЗапрос.КоличествоПриходНач = 0
		|									ТОГДА ОКР(ВложенныйЗапрос.СтоимостьПриходНач / 1, 2)
		|								ИНАЧЕ ОКР(ВложенныйЗапрос.СтоимостьПриходНач / ВложенныйЗапрос.КоличествоПриходНач, 2)
		|							КОНЕЦ) КАК Себестоимость
		|					ИЗ
		|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|							ВЫБОР
		|								КОГДА ПартииТоваровНаСкладахОстатки.Номенклатура ЕСТЬ NULL
		|									ТОГДА ПартииТоваровНаСкладахОбороты.Номенклатура
		|								ИНАЧЕ ПартииТоваровНаСкладахОстатки.Номенклатура
		|							КОНЕЦ КАК Номенклатура,
		|							ВЫБОР
		|								КОГДА ПартииТоваровНаСкладахОстатки.ХарактеристикаНоменклатуры ЕСТЬ NULL
		|									ТОГДА ПартииТоваровНаСкладахОбороты.ХарактеристикаНоменклатуры
		|								ИНАЧЕ ПартииТоваровНаСкладахОстатки.ХарактеристикаНоменклатуры
		|							КОНЕЦ КАК ХарактеристикаНоменклатуры,
		|							СУММА(ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ПартииТоваровНаСкладахОбороты.КоличествоПриход, 0)) КАК КоличествоПриходНач,
		|							СУММА(ЕСТЬNULL(ПартииТоваровНаСкладахОстатки.СтоимостьОстаток, 0) + ЕСТЬNULL(ПартииТоваровНаСкладахОбороты.СтоимостьПриход, 0)) КАК СтоимостьПриходНач
		|						ИЗ
		|							РегистрНакопления.ПартииТоваровНаСкладах.Остатки(&НачПериода, Номенклатура.Родитель = &ГруппаMiles) КАК ПартииТоваровНаСкладахОстатки
		|								ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровНаСкладах.Обороты(&НачПериода, &КонПериода, Регистратор, Номенклатура.Родитель = &ГруппаMiles) КАК ПартииТоваровНаСкладахОбороты
		|								ПО ПартииТоваровНаСкладахОстатки.Номенклатура = ПартииТоваровНаСкладахОбороты.Номенклатура
		|									И ПартииТоваровНаСкладахОстатки.ХарактеристикаНоменклатуры = ПартииТоваровНаСкладахОбороты.ХарактеристикаНоменклатуры
		|									И ПартииТоваровНаСкладахОстатки.ДокументОприходования = ПартииТоваровНаСкладахОбороты.ДокументОприходования
		|									И ПартииТоваровНаСкладахОстатки.Заказ = ПартииТоваровНаСкладахОбороты.Заказ
		|									И ПартииТоваровНаСкладахОстатки.Склад = ПартииТоваровНаСкладахОбороты.Склад
		|									И ПартииТоваровНаСкладахОстатки.СерияНоменклатуры = ПартииТоваровНаСкладахОбороты.СерияНоменклатуры
		|									И ПартииТоваровНаСкладахОстатки.СтатусПартии = ПартииТоваровНаСкладахОбороты.СтатусПартии
		|									И ПартииТоваровНаСкладахОстатки.Качество = ПартииТоваровНаСкладахОбороты.Качество
		|						
		|						СГРУППИРОВАТЬ ПО
		|							ВЫБОР
		|								КОГДА ПартииТоваровНаСкладахОстатки.Номенклатура ЕСТЬ NULL
		|									ТОГДА ПартииТоваровНаСкладахОбороты.Номенклатура
		|								ИНАЧЕ ПартииТоваровНаСкладахОстатки.Номенклатура
		|							КОНЕЦ,
		|							ВЫБОР
		|								КОГДА ПартииТоваровНаСкладахОстатки.ХарактеристикаНоменклатуры ЕСТЬ NULL
		|									ТОГДА ПартииТоваровНаСкладахОбороты.ХарактеристикаНоменклатуры
		|								ИНАЧЕ ПартииТоваровНаСкладахОстатки.ХарактеристикаНоменклатуры
		|							КОНЕЦ) КАК ВложенныйЗапрос
		|					
		|					СГРУППИРОВАТЬ ПО
		|						ВложенныйЗапрос.Номенклатура,
		|						ВложенныйЗапрос.ХарактеристикаНоменклатуры) КАК ВложенныйЗапрос) КАК ТаблСебестоимость
		|				ПО ВтПродажи.Номенклатура = ТаблСебестоимость.Номенклатура
		|					И ВтПродажи.ХарактеристикаНоменклатуры = ТаблСебестоимость.ХарактеристикаНоменклатуры
		|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					ТоварыОтветственногоХраненияОбороты.Регистратор КАК Регистратор,
		|					ТоварыОтветственногоХраненияОбороты.Номенклатура КАК Номенклатура,
		|					ТоварыОтветственногоХраненияОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|					ТоварыОтветственногоХраненияОбороты.Контрагент КАК Контрагент,
		|					ТоварыОтветственногоХраненияОбороты.КоличествоОборот * -1 КАК КоличествоОборот
		|				ИЗ
		|					РегистрНакопления.ТоварыОтветственногоХранения.Обороты(&НачПериода, &КонПериода, Регистратор, Номенклатура.Родитель = &ГруппаMiles) КАК ТоварыОтветственногоХраненияОбороты
		|				ГДЕ
		|					ВЫРАЗИТЬ(ТоварыОтветственногоХраненияОбороты.Регистратор КАК Документ.РеализацияТоваровУслуг) ЕСТЬ НЕ NULL 
		|				{ГДЕ
		|					ТоварыОтветственногоХраненияОбороты.Номенклатура.*,
		|					ТоварыОтветственногоХраненияОбороты.ХарактеристикаНоменклатуры.*}) КАК ТаблТОХ
		|				ПО ВтПродажи.Номенклатура = ТаблТОХ.Номенклатура
		|					И ВтПродажи.ХарактеристикаНоменклатуры = ТаблТОХ.ХарактеристикаНоменклатуры
		|					И ВтПродажи.Регистратор = ТаблТОХ.Регистратор
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ВтПродажи.Регистратор,
		|			ВтПродажи.Номенклатура,
		|			ВтПродажи.КоличествоОборот,
		|			ЕСТЬNULL(ТаблТОХ.КоличествоОборот, 0),
		|			ВтПродажи.Период,
		|			ЕСТЬNULL(ТаблТОХ.СебестоимостьТОХ, 0),
		|			ВтПродажи.СтоимостьОборот
		|		ИЗ
		|			ВтПродажи КАК ВтПродажи
		|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					ВложенныйЗапрос.Регистратор КАК Регистратор,
		|					ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|					ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|					ВложенныйЗапрос.Контрагент КАК Контрагент,
		|					ВложенныйЗапрос.КоличествоОборот * -1 КАК КоличествоОборот,
		|					ЕСТЬNULL(ЦеныНоменклатурыКонтрагентов.Цена, 0) * ВложенныйЗапрос.КоличествоОборот * -1 КАК СебестоимостьТОХ
		|				ИЗ
		|					(ВЫБРАТЬ
		|						ТоварыОтветственногоХраненияОбороты.Регистратор КАК Регистратор,
		|						ТоварыОтветственногоХраненияОбороты.Номенклатура КАК Номенклатура,
		|						ТоварыОтветственногоХраненияОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|						ТоварыОтветственногоХраненияОбороты.Контрагент КАК Контрагент,
		|						МАКСИМУМ(ТоварыОтветственногоХраненияОбороты.КоличествоОборот) КАК КоличествоОборот,
		|						ТоварыОтветственногоХраненияОбороты.ДоговорКонтрагента.ТипЦен КАК ТипЦен,
		|						МАКСИМУМ(ЦеныНоменклатурыКонтрагентов.Период) КАК ПериодЦены
		|					ИЗ
		|						РегистрНакопления.ТоварыОтветственногоХранения.Обороты(&НачПериода, &КонПериода, Регистратор, Номенклатура.Родитель = &ГруппаMiles) КАК ТоварыОтветственногоХраненияОбороты
		|							ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыКонтрагентов КАК ЦеныНоменклатурыКонтрагентов
		|							ПО ТоварыОтветственногоХраненияОбороты.Период >= ЦеныНоменклатурыКонтрагентов.Период
		|								И ТоварыОтветственногоХраненияОбороты.Номенклатура = ЦеныНоменклатурыКонтрагентов.Номенклатура
		|								И ТоварыОтветственногоХраненияОбороты.ДоговорКонтрагента.ТипЦен = ЦеныНоменклатурыКонтрагентов.ТипЦен
		|					ГДЕ
		|						ВЫРАЗИТЬ(ТоварыОтветственногоХраненияОбороты.Регистратор КАК Документ.РеализацияТоваровУслуг) ЕСТЬ НЕ NULL 
		|					{ГДЕ
		|						ТоварыОтветственногоХраненияОбороты.Номенклатура.*,
		|						ТоварыОтветственногоХраненияОбороты.ХарактеристикаНоменклатуры.*}
		|					
		|					СГРУППИРОВАТЬ ПО
		|						ТоварыОтветственногоХраненияОбороты.ДоговорКонтрагента.ТипЦен,
		|						ТоварыОтветственногоХраненияОбороты.Регистратор,
		|						ТоварыОтветственногоХраненияОбороты.Номенклатура,
		|						ТоварыОтветственногоХраненияОбороты.ХарактеристикаНоменклатуры,
		|						ТоварыОтветственногоХраненияОбороты.Контрагент) КАК ВложенныйЗапрос
		|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыКонтрагентов КАК ЦеныНоменклатурыКонтрагентов
		|						ПО ВложенныйЗапрос.ПериодЦены = ЦеныНоменклатурыКонтрагентов.Период
		|							И ВложенныйЗапрос.Номенклатура = ЦеныНоменклатурыКонтрагентов.Номенклатура
		|							И ВложенныйЗапрос.ТипЦен = ЦеныНоменклатурыКонтрагентов.ТипЦен) КАК ТаблТОХ
		|				ПО ВтПродажи.Номенклатура = ТаблТОХ.Номенклатура
		|					И ВтПродажи.Регистратор = ТаблТОХ.Регистратор
		|					И ВтПродажи.ХарактеристикаНоменклатуры = ТаблТОХ.ХарактеристикаНоменклатуры) КАК ВложенныйЗапрос
		|	
		|	СГРУППИРОВАТЬ ПО
		|		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, ДЕНЬ)
		|	
		|	ИМЕЮЩИЕ
		|		(СУММА(ВложенныйЗапрос.Количество) <> 0
		|			ИЛИ СУММА(ВложенныйЗапрос.Себестоимость) <> 0
		|			ИЛИ СУММА(ВЫБОР
		|					КОГДА ВложенныйЗапрос.КоличествоОборот = 0
		|						ТОГДА ВложенныйЗапрос.Стоимость
		|					ИНАЧЕ ВложенныйЗапрос.Стоимость * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоОборот
		|				КОНЕЦ) <> 0)) КАК ВложенныйЗапрос
		|ИТОГИ
		|	СУММА(ВаловаяПрибыль)
		|ПО
		|	ОБЩИЕ";
		
		Запрос.УстановитьПараметр("НачПериода",  НачалоМесяца(ДатаОтчета));
		Запрос.УстановитьПараметр("КонПериода",  КонецДня(ДатаОтчета));
		Запрос.УстановитьПараметр("ГруппаMiles", ГруппаMiles);  
		Запрос.УстановитьПараметр("Валюта", Справочники.Валюты.НайтиПоКоду("978")); 
		
		Если НЕ СписокКонтрагентов.Количество() = 0 Тогда
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "%УсловиеКонтрагент%", "И НЕ Контрагент В (&СписокКонтрагентов)");
			Запрос.УстановитьПараметр("СписокКонтрагентов", СписокКонтрагентов);
			
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "%УсловиеКонтрагент%", "");
		КонецЕсли;
		
		СуммаОборот = 0;
		
		Результат = Запрос.ВыполнитьПакет();
		ВыборкаОборот = Результат[4].Выбрать(); 
		
		Если ВыборкаОборот.Следующий() Тогда
			СуммаОборот = ВыборкаОборот.СтоимостьОборот;
		КонецЕсли; 
		
		Сумма8 = СуммаОборот;  
		Сумма9 = 0;   
		
		ВыборкаКоличество = Результат[6].Выбрать();
		
		Если ВыборкаКоличество.Следующий() Тогда
			Сумма9 = ВыборкаКоличество.КоличествоКонтрагентов;
		КонецЕсли;  
		
		СуммаОборотУпр = 0;
		ВыборкаСуммаОборотУпр = Результат[7].Выбрать(); 
		
		Если ВыборкаСуммаОборотУпр.Следующий() Тогда
			СуммаОборотУпр = ВыборкаСуммаОборотУпр.Стоимость;
		КонецЕсли; 
		
		Сумма10 = СуммаОборотУпр;
		
		СуммаСебестоимость = 0;
		
		ВыборкаВалПрибыль = Результат[8].Выбрать();
		
		Если ВыборкаВалПрибыль.Следующий() Тогда
			СуммаСебестоимость = ВыборкаВалПрибыль.ВаловаяПрибыль;
		КонецЕсли;
		
		Сумма11 = СуммаСебестоимость;
	
	КонецЕсли;

	Макет  = ПолучитьМакет("Макет1");
	
	ТабДок = Новый ТабличныйДокумент;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Область1");
	
	ОбластьМакета.Параметры.Филиал = """"+Строка(Константы.База.Получить())+""""+" на  : "+Строка(ТекущаяДата());
	ОбластьМакета.Параметры.Склад = ?(Склад = Справочники.Склады.ПустаяСсылка()," ВСЕ СКЛАДЫ",Склад);
	
	ОбластьМакета.Параметры.Сумма1   = Окр(Сумма1,0,1);
	ОбластьМакета.Параметры.Сумма2   = Окр(Сумма2,0,1);    //Сумма2;
	ОбластьМакета.Параметры.Сумма3   = Окр(Сумма3,0,1);    //Сумма3;
	ОбластьМакета.Параметры.Сумма3_1 = Окр(Сумма3_1,0,1);  //Сумма3_1;
	ОбластьМакета.Параметры.Сумма4   = Сумма4;  		   //Сумма4;
	ОбластьМакета.Параметры.Сумма5   = Окр(Сумма5,0,1);    //Сумма5;
	ОбластьМакета.Параметры.Сумма7   = Окр(Сумма7,0,1);    //Сумма7;
	
	ТабДок.Вывести(ОбластьМакета);     
	
	Если ЗначениеЗаполнено(ГруппаMiles) Тогда  
		
		ОбластьМакета = Макет.ПолучитьОбласть("ОбластьMiles"); 
		
		ОбластьМакета.Параметры.Сумма8 = Окр(Сумма8, 0, 1); 
		ОбластьМакета.Параметры.Сумма9 = Окр(Сумма9, 0, 1); 
		ОбластьМакета.Параметры.Сумма10 = Окр(Сумма10, 0, 1);  
		ОбластьМакета.Параметры.Сумма11 = Окр(Сумма11, 0, 1);
		ТабДок.Вывести(ОбластьМакета); 
		
	КонецЕсли;
	
	Если НЕ Интерактивно Тогда
		
		ТабДок.Показать();
		Возврат;
		
	КонецЕсли;

	СтруктураФайла = Новый Структура("ИмяВременногоФайла,ИмяДляОтправки", ПолучитьИмяВременногоФайла(".XLSX"), "ЕжедневныйОтчет.XLSX");
	ТабДок.Записать(СтруктураФайла.ИмяВременногоФайла,ТипФайлаТабличногоДокумента.XLSX);
	УчетнаяЗапись = Константы.ОсновнаяУчетнаяЗаписьЭлектроннойПочты.Получить();
	
	Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);
	Почта = Новый ИнтернетПочта; 
	УдалосьПодключиться = Ложь;
	
	Попытка
		
		Почта.Подключиться(Профиль);
		УдалосьПодключиться = Истина;
		
	Исключение
	КонецПопытки;
	
	Если НЕ УдалосьПодключиться Тогда 
		
		Попытка
			
			Почта.Подключиться(Профиль);
			УдалосьПодключиться = Истина;
			
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
	Если НЕ УдалосьПодключиться Тогда 
		
		Попытка
			
			Почта.Подключиться(Профиль);
			УдалосьПодключиться = Истина;
			
		Исключение
			
			ЗаписьЖурналаРегистрации("Отправка электронной почты.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, "Не удалось подключиться к почтовому серверу");
			Возврат;
			
		КонецПопытки;
		
	КонецЕсли;
	
	Для каждого ТекСтр Из ТаблицаЭлАдресов  Цикл
		
		ТемаСообщения = "Ежедневный отчет " + СокрЛП(Константы.База.Получить());
		Сообщение = Новый ИнтернетПочтовоеСообщение;
		Сообщение.Тема = ТемаСообщения;
		МылоКонтрагента =  ТекСтр.ЭлАдрес;   //"svetlov_dn@moskvorechie.ru"; //
		Сообщение.Получатели.Добавить(ТекСтр.ЭлАдрес);  
		Сообщение.Отправитель = УчетнаяЗапись.АдресЭлектроннойПочты;
		Сообщение.Вложения.Добавить(Новый ДвоичныеДанные(СтруктураФайла.ИмяВременногоФайла), СтруктураФайла.ИмяДляОтправки);
		
		Попытка
			
			Почта.Послать(Сообщение);
			ТекстСообщения = "Отправлен ежедневный отчет на адрес : " + МылоКонтрагента;
			ЗаписьЖурналаРегистрации("Отправка электронной почты.Успешно", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
			
		Исключение
			
			ТекстСообщения = "Не отправлен ежедневный отчет на адрес : "+МылоКонтрагента;
			ЗаписьЖурналаРегистрации("Отправка электронной почты.Ошибка",УровеньЖурналаРегистрации.Ошибка,,,ТекстСообщения);
			
		КонецПопытки;
		
		Сообщение.Получатели.Очистить();
		Сообщение.Вложения.Очистить();
		
	КонецЦикла; 
	
	УдалитьФайлы(СтруктураФайла.ИмяВременногоФайла);
	СтруктураФайла.Очистить();	

КонецПроцедуры

Процедура ВосстановитьНастройкиРегламентаИзСтруктуры(СохраненнаяНастройка) Экспорт
	
	СохраненнаяНастройка.Свойство("СписокКонтрагентов", СписокКонтрагентов);

КонецПроцедуры

Процедура СохранитьНастройкиРегламентаВСтруктуру(СохраненнаяНастройка) Экспорт
	
	СохраненнаяНастройка.Вставить("СписокКонтрагентов", СписокКонтрагентов);	

КонецПроцедуры
